_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 48, 48, 3)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 48, 48, 32)        896       
_________________________________________________________________
batch_normalization_8 (Batch (None, 48, 48, 32)        128       
_________________________________________________________________
p_re_lu_8 (PReLU)            (None, 48, 48, 32)        73728     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 48, 48, 32)        9248      
_________________________________________________________________
batch_normalization_9 (Batch (None, 48, 48, 32)        128       
_________________________________________________________________
p_re_lu_9 (PReLU)            (None, 48, 48, 32)        73728     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 24, 24, 32)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 24, 24, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 24, 24, 64)        18496     
_________________________________________________________________
batch_normalization_10 (Batc (None, 24, 24, 64)        256       
_________________________________________________________________
p_re_lu_10 (PReLU)           (None, 24, 24, 64)        36864     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 24, 24, 64)        36928     
_________________________________________________________________
batch_normalization_11 (Batc (None, 24, 24, 64)        256       
_________________________________________________________________
p_re_lu_11 (PReLU)           (None, 24, 24, 64)        36864     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 12, 12, 128)       73856     
_________________________________________________________________
batch_normalization_12 (Batc (None, 12, 12, 128)       512       
_________________________________________________________________
p_re_lu_12 (PReLU)           (None, 12, 12, 128)       18432     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 12, 12, 128)       147584    
_________________________________________________________________
batch_normalization_13 (Batc (None, 12, 12, 128)       512       
_________________________________________________________________
p_re_lu_13 (PReLU)           (None, 12, 12, 128)       18432     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 6, 6, 128)         0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 6, 6, 128)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 512)               2359808   
_________________________________________________________________
batch_normalization_14 (Batc (None, 512)               2048      
_________________________________________________________________
p_re_lu_14 (PReLU)           (None, 512)               512       
_________________________________________________________________
dropout_8 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 50)                25650     
=================================================================
Total params: 2,934,866
Trainable params: 2,932,946
Non-trainable params: 1,920
_________________________________________________________________
None
