_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 48, 48, 3)         0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 48, 48, 32)        896       
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 48, 48, 32)        9248      
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 24, 24, 32)        0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 24, 24, 32)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 24, 24, 64)        18496     
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 24, 24, 64)        36928     
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 12, 12, 128)       73856     
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 12, 12, 128)       147584    
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 6, 6, 128)         0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 6, 6, 128)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 256)               1179904   
_________________________________________________________________
dropout_16 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 43)                11051     
=================================================================
Total params: 1,477,963
Trainable params: 1,477,963
Non-trainable params: 0
_________________________________________________________________
None
